Revit 2027 API
BuiltInFailures.ConnectorFailures.SizingCalculationNoneWarn Property
 Some elements are not sized because the system calculation level is none or performance. You may change the system calculation level to size them again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SizingCalculationNoneWarn { get; }
Public Shared ReadOnly Property SizingCalculationNoneWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SizingCalculationNoneWarn {
	FailureDefinitionId^ get ();
}
static member SizingCalculationNoneWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace